In [1]:
import pandas as pd

In [2]:
df4 = pd.read_csv('./Olist_sales_dataset/df4_olist_order_payments_dataset.csv')

In [3]:
# View the first or last few rows to understand the structure.

df4.head()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39
2,25e8ea4e93396b6fa0d3dd708e76c1bd,1,credit_card,1,65.71
3,ba78997921bbcdc1373bb41e913ab953,1,credit_card,8,107.78
4,42fdf880ba16b47b59251dd489d4441a,1,credit_card,2,128.45

In [4]:
# Check data types and see if there are any missing values.

df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103886 entries, 0 to 103885
Data columns (total 5 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   order_id              103886 non-null  object
 1   payment_sequential    103886 non-null  int64
 2   payment_type          103886 non-null  object
 3   payment_installments  103886 non-null  int64
 4   payment_value         103886 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 4.0+ MB

In [5]:
# Get summary statistics for numerical columns.

df4.describe()

       payment_sequential  payment_installments  payment_value
count       103886.000000         103886.000000  103886.000000
mean             1.092679              2.853349     154.100380
std              0.706584              2.687051     217.494064
min              1.000000              0.000000       0.000000
25%              1.000000              1.000000      56.790000
50%              1.000000              1.000000     100.000000
75%              1.000000              4.000000     171.837500
max             29.000000             24.000000   13664.080000

In [6]:
# Check the number of rows and columns in your dataset.

df4.shape

(103886, 5)

## Handling Missing Data

In [7]:
#  Check for missing values in each column

df4.isnull().sum()

order_id                0
payment_sequential      0
payment_type            0
payment_installments    0
payment_value           0
dtype: int64

In [8]:
# Remove rows with missing values 

clean_df4 = df4.dropna()

## Handling Duplicates:

In [9]:
# Check for and remove duplicate rows:

clean_df4.drop_duplicates(inplace=True)

## Column Renaming and Reordering:

In [10]:
# Rename columns for clarity and reorder them as needed:

clean_df4.rename(columns={'order_id':'Order id',
                          'payment_sequential':'Payment sequential',
                         'payment_type':'Payment type',
                           'payment_installments':'Payment installments',
                         'payment_value':'Payment value'}, inplace=True)

clean_df4

,Order id,Payment sequential,Payment type,Payment installments,Payment value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39
2,25e8ea4e93396b6fa0d3dd708e76c1bd,1,credit_card,1,65.71
3,ba78997921bbcdc1373bb41e913ab953,1,credit_card,8,107.78
4,42fdf880ba16b47b59251dd489d4441a,1,credit_card,2,128.45
...,...,...,...,...,...
103881,0406037ad97740d563a178ecc7a2075c,1,boleto,1,363.31
103882,7b905861d7c825891d6347454ea7863f,1,credit_card,2,96.80
103883,32609bbb3dd69b3c066a6860554a77bf,1,credit_card,1,47.77
103884,b8b61059626efa996a60be9bb9320e10,1,credit_card,5,369.54
103885,28bbae6599b09d39ca406b747b6632b1,1,boleto,1,191.58

## Saving the Cleaned Data

In [11]:
clean_df4.to_csv('cleaned_dataset_df4.csv', index=False)